[
  {
    "id": 1,
    "name": "SavvyCard",
    "imgSrc": "/static/client-images/savvy-card.png",
    "thumbnailSrc": "/static/thumbnails/tn-savvy-card.jpg",
    "initiative": "Client side development",
    "description": "<p><a href=\"http://savvycard.com\">SavvyCard</a> was my most current initiative. This project involved outward facing work developing the newly designed blog and client login screens. This required user interface development utilizing html5, css3, BEM, and WordPress/PHP integration along with jQuery, javascript and a new WebPack build system.</p><p>There was also a web app portion developing their individual \"cards\" using extensive PHP drawing from a large MySQL database for displaying and formatting data system wide. I programmed four new client initiatives for geographic real estate areas, and also a project connecting potential clients with local services tied to these geographical areas. In addition, I developed a new Grunt build system that addressed moving legacy inline javascript and CSS code into their proper view code areas, concatenation and minifying this code which brought down the network load by 20%.</p>"
  },
  {
    "id": 2,
    "name": "Marlowe McNabb",
    "imgSrc": "/static/client-images/marlowe-mcnabb.png",
    "thumbnailSrc": "/static/thumbnails/tn-marlowe-mcnabb.jpg",
    "description": "<p>The project updated a legacy xthml for a local attorney firm's site and brought it up to date with Relative Width Design and WordPress integration so that the clients could make updates and edits independently.</p><p>I had a hand in the design and coded with html5 and css3 allowing the client to present their site on smart phone and tablet friendly layouts. I also implemented a bit of jQuery and javascript in order to produce interactive elements such as drawer menu and drop-down navigation.</p>These modifications also helped extraordinarily in search engine rankings and a noted uptick in traffic along with a significant boost in potential client contacts.</p>"
  },
  {
    "id": 3,
    "name": "Office Depot Office Max",
    "imgSrc": "/static/client-images/od-rewards.png",
    "thumbnailSrc": "/static/thumbnails/tn-od-rewards.jpg",
    "description": "<p>The main initiative for my experience with Office Deopot was to seamlessly integrate with the legacy Office Max site which Office Depot inherited with their merger of the two companies while maintaining features with the main Office Depot site and their B2B site.</p><p>One of the larger initiatives was to funnel existing Office Max rewards customers into the flow of the Office Depot rewards program in such a way that the rewards customers were not put off or made to feel lost with the brand new experience after we pulled the switch.</p><p>This involved integrating mulitple data points, redesigned forms, client and server side validation and a new password strength meter in order to reflect care and security for the Office Max customers being ported over.</p><p>The skills involved included a modular jQuery system for client side interactivity, JSTL for templating database information from a Java/WebSphere backend architecture.</p><p>In addtion, I did work updating the client side for the shopping cart, updating the corporate identity to Office Depot/OfficeMax site-wide as well as extensive updates to the account management system.</p><p>I found this experience very challenging and rewarding as OfficeDepot was a top ten e-commerce site at this time competing directly with Staples and Amazon.com.</p>"
  },
  {
    "id": 4,
    "name": "Rooms to Go iSofa",
    "imgSrc": "/static/client-images/rtg-isofa.png",
    "thumbnailSrc": "/static/thumbnails/tn-rtg-isofa.jpg",
    "description": "<p>The <a href=\"http://rooomstogo.com/isofa\">Rooms to Go iSofa</a> initiaive was a project that let users customize sofa features such as style, color, material and pillows through their e-commerce site as well as touch screen based kiosks found in their brick and mortar retail outlets.</p><p>The backend was founded upon the Java ATG e-commerce platform. The most challenging part was to integrate the client side with the database using extensive AJAX calls in order to display dynamic data, build DOM components such as the shopping cart and wishlist and sending user form generated data to the database for a seamless user experience with round trips from the user interface to the database and back.</p><p>I was also responsible for the HTML5 markup and CSS3 features for a clean user interfact to aid in the overall virtural shopping expereience for the client.</p><p>This required all my skills as a frontend developer in order to help bring this experience to life which has been viewed as a very crucial step in bringing the Rooms to Go brand to a vast digital audience.</p>"
  },
  {
    "id": 5,
    "name": "WalMart Electronics Center",
    "imgSrc": "/static/client-images/wm-electronics-center.png",
    "thumbnailSrc": "/static/thumbnails/tn-wm-electronics-center.jpg",
    "description": "<p>During my four year tenure with <a href=\"http://triadretailmedia.com\">Triad Retail Media</a>, I was the main frontend developer for their client initiatives for WalMart. I would pull together the assets ranging from copy to video content to imagery and do all the building involving HTML, CSS and javascript.</p><p>We would do projects as varied as one page ads for third party fortune 100 corporate clients, seasonal promotions from New Years Day to Christmas and every holiday in between, a recipe feature where users could upload and share recipes to lifestyle content with all the client side features integrated into the .Net server side code and custom CMS where applicable.</p><p>WalMart was a very demanding client and everything needed to be pixel perfect and on time, no excuses. This proved to be higly challengin yet rewarding as new initiatives were coming down the pipes at all times.</p><p>I was also instrumental in helping migrate the main ad areas from flash based interactive features over to jQuery features to help with cross browser compatibility, proper markup for search engines and metrics software as well as being viewable in smart phones and tablets as those moved from edge cases to consumer standards for viewing web content.</p>"
  },
  {
    "id": 6,
    "name": "E-Bay Mod Jobs",
    "imgSrc": "/static/client-images/ebay-mod-jobs.png",
    "thumbnailSrc": "/static/thumbnails/tn-ebay-mod-jobs.jpg",
    "description": "During my time with <a href=\"http://triadretailmedia.com\">Triad Retail Media</a>, I also had the opportunity to work on projects with other high end retail outlets such as Sams Club, CVS, Toys R Us and Dell computers. Through these successes, we were able to add E-Bay to the client list.</p><p>This entailed integration with their CMS and I was involved with developing a customized Restful API which communicated with their database server in a secure and efficient manner. </p><p>Again, I would be responsible for building out HTML assets with CSS presentation and jQuery/javascript features for carousels, AJAX calls to the API, layered navigation and other clients side interactive features.<p>These features would then be integrated into E-Bay's site in order to jump seamlessly into their client biddding based shopping cart system.</p>"
  }
]
